let Citys = [
  {
    id: 1,
    name: "北京市",
    cities: [
      {
        id: 1,
        name: "北京市",
        areas: [
          "东城区",
          "西城区",
          "朝阳区",
          "丰台区",
          "石景山区",
          "海淀区",
          "门头沟区",
          "房山区",
          "通州区",
          "顺义区",
          "昌平区",
          "大兴区",
          "怀柔区",
          "平谷区",
          "密云区",
          "延庆区",
        ],
      },
    ],
  },
  {
    id: 2,
    name: "天津市",
    cities: [
      {
        id: 2,
        name: "天津市",
        areas: [
          "和平区",
          "河东区",
          "河西区",
          "南开区",
          "河北区",
          "红桥区",
          "东丽区",
          "西青区",
          "津南区",
          "北辰区",
          "武清区",
          "宝坻区",
          "滨海新区",
          "宁河区",
          "静海区",
          "蓟州区",
        ],
      },
    ],
  },
  {
    id: 3,
    name: "河北省",
    cities: [
      {
        id: 3,
        name: "石家庄市",
        areas: [
          "长安区",
          "桥西区",
          "新华区",
          "井陉矿区",
          "裕华区",
          "栾城区",
          "鹿泉区",
          "深泽县",
          "无极县",
          "平山县",
          "元氏县",
          "赵县",
          "辛集市",
          "藁城区",
          "晋州市",
          "新乐市",
        ],
      },
      {
        id: 4,
        name: "唐山市",
        areas: [
          "路南区",
          "路北区",
          "古冶区",
          "开平区",
          "丰南区",
          "丰润区",
          "曹妃甸区",
          "滦南县",
          "乐亭县",
          "迁西县",
          "玉田县",
          "唐海县",
          "遵化市",
          "迁安市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 4,
    name: "山西省",
    cities: [
      {
        id: 5,
        name: "太原市",
        areas: [
          "小店区",
          "迎泽区",
          "杏花岭区",
          "尖草坪区",
          "万柏林区",
          "晋源区",
          "清徐县",
          "阳曲县",
          "娄烦县",
          "古交市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 5,
    name: "内蒙古自治区",
    cities: [
      {
        id: 6,
        name: "呼和浩特市",
        areas: [
          "新城区",
          "回民区",
          "玉泉区",
          "赛罕区",
          "土默特左旗",
          "托克托县",
          "和林格尔县",
          "清水河县",
          "武川县",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 6,
    name: "辽宁省",
    cities: [
      {
        id: 7,
        name: "沈阳市",
        areas: [
          "和平区",
          "沈河区",
          "大东区",
          "皇姑区",
          "铁西区",
          "苏家屯区",
          "浑南区",
          "沈北新区",
          "于洪区",
          "辽中县",
          "康平县",
          "法库县",
          "新民市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 7,
    name: "吉林省",
    cities: [
      {
        id: 8,
        name: "长春市",
        areas: [
          "南关区",
          "宽城区",
          "朝阳区",
          "二道区",
          "绿园区",
          "双阳区",
          "九台区",
          "农安县",
          "榆树市",
          "德惠市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 8,
    name: "黑龙江省",
    cities: [
      {
        id: 9,
        name: "哈尔滨市",
        areas: [
          "道里区",
          "南岗区",
          "道外区",
          "香坊区",
          "平房区",
          "松北区",
          "呼兰区",
          "依兰县",
          "方正县",
          "宾县",
          "巴彦县",
          "阿城区",
          "五常市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 9,
    name: "江苏省",
    cities: [
      {
        id: 10,
        name: "南京市",
        areas: [
          "玄武区",
          "秦淮区",
          "建邺区",
          "鼓楼区",
          "浦口区",
          "栖霞区",
          "雨花台区",
          "江宁区",
          "六合区",
          "溧水区",
          "高淳区",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 10,
    name: "浙江省",
    cities: [
      {
        id: 11,
        name: "杭州市",
        areas: [
          "上城区",
          "下城区",
          "江干区",
          "拱墅区",
          "西湖区",
          "滨江区",
          "萧山区",
          "余杭区",
          "桐庐县",
          "淳安县",
          "建德市",
          "富阳区",
          "临安区",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 11,
    name: "安徽省",
    cities: [
      {
        id: 12,
        name: "合肥市",
        areas: [
          "瑶海区",
          "庐阳区",
          "蜀山区",
          "包河区",
          "长丰县",
          "肥东县",
          "肥西县",
          "庐江县",
          "巢湖市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 12,
    name: "福建省",
    cities: [
      {
        id: 13,
        name: "福州市",
        areas: [
          "鼓楼区",
          "台江区",
          "仓山区",
          "马尾区",
          "晋安区",
          "闽侯县",
          "连江县",
          "罗源县",
          "闽清县",
          "永泰县",
          "平潭县",
          "福清市",
          "长乐市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 13,
    name: "江西省",
    cities: [
      {
        id: 14,
        name: "南昌市",
        areas: [
          "东湖区",
          "西湖区",
          "青云谱区",
          "湾里区",
          "青山湖区",
          "新建区",
          "南昌县",
          "进贤县",
          "安义县",
          "经济技术开发区",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 14,
    name: "山东省",
    cities: [
      {
        id: 15,
        name: "济南市",
        areas: [
          "历下区",
          "市中区",
          "槐荫区",
          "天桥区",
          "历城区",
          "长清区",
          "平阴县",
          "济阳区",
          "商河县",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 15,
    name: "河南省",
    cities: [
      {
        id: 16,
        name: "郑州市",
        areas: [
          "中原区",
          "二七区",
          "管城回族区",
          "金水区",
          "上街区",
          "惠济区",
          "中牟县",
          "巩义市",
          "荥阳市",
          "新密市",
          "新郑市",
          "登封市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 16,
    name: "湖北省",
    cities: [
      {
        id: 17,
        name: "武汉市",
        areas: [
          "江岸区",
          "江汉区",
          "硚口区",
          "汉阳区",
          "武昌区",
          "青山区",
          "洪山区",
          "东西湖区",
          "汉南区",
          "蔡甸区",
          "江夏区",
          "黄陂区",
          "新洲区",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 17,
    name: "湖南省",
    cities: [
      {
        id: 18,
        name: "长沙市",
        areas: [
          "芙蓉区",
          "天心区",
          "岳麓区",
          "开福区",
          "雨花区",
          "望城区",
          "长沙县",
          "宁乡市",
          "浏阳市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 18,
    name: "广东省",
    cities: [
      {
        id: 19,
        name: "广州市",
        areas: [
          "越秀区",
          "荔湾区",
          "海珠区",
          "天河区",
          "白云区",
          "黄埔区",
          "番禺区",
          "花都区",
          "南沙区",
          "从化区",
          "增城区",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 19,
    name: "海南省",
    cities: [
      {
        id: 20,
        name: "海口市",
        areas: [
          "美兰区",
          "龙华区",
          "秀英区",
          "琼山区",
          "万宁市",
          "琼海市",
          "文昌市",
          "东方市",
          "临高县",
          "澄迈县",
          "定安县",
          "屯昌县",
          "陵水黎族自治县",
          "保亭黎族苗族自治县",
          "琼中黎族苗族自治县",
        ],
      },
    ],
  },
  {
    id: 20,
    name: "四川省",
    cities: [
      {
        id: 21,
        name: "成都市",
        areas: [
          "锦江区",
          "青羊区",
          "金牛区",
          "武侯区",
          "成华区",
          "龙泉驿区",
          "青白江区",
          "新都区",
          "温江区",
          "双流区",
          "郫都区",
          "大邑县",
          "蒲江县",
          "新津县",
          "都江堰市",
          "彭州市",
          "邛崃市",
          "崇州市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 21,
    name: "贵州省",
    cities: [
      {
        id: 22,
        name: "贵阳市",
        areas: [
          "南明区",
          "云岩区",
          "花溪区",
          "乌当区",
          "白云区",
          "小河区",
          "开阳县",
          "修文县",
          "息烽县",
          "凤冈县",
          "湄潭县",
          "余庆县",
          "习水县",
          "贵州经济技术开发区",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 22,
    name: "云南省",
    cities: [
      {
        id: 23,
        name: "昆明市",
        areas: [
          "五华区",
          "盘龙区",
          "官渡区",
          "西山区",
          "东川区",
          "呈贡区",
          "晋宁区",
          "斗南镇",
          "宣威市",
          "安宁市",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 23,
    name: "西藏自治区",
    cities: [
      {
        id: 24,
        name: "拉萨市",
        areas: [
          "城关区",
          "堆龙德庆区",
          "达孜区",
          "尼木县",
          "曲水县",
          "墨竹工卡县",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 24,
    name: "陕西省",
    cities: [
      {
        id: 25,
        name: "西安市",
        areas: [
          "新城区",
          "碑林区",
          "莲湖区",
          "灞桥区",
          "未央区",
          "雁塔区",
          "阎良区",
          "临潼区",
          "长安区",
          "高陵区",
          "鄠邑区",
          "蓝田县",
          "周至县",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 25,
    name: "甘肃省",
    cities: [
      {
        id: 26,
        name: "兰州市",
        areas: [
          "城关区",
          "七里河区",
          "西固区",
          "安宁区",
          "红古区",
          "永登县",
          "皋兰县",
          "榆中县",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 26,
    name: "青海省",
    cities: [
      {
        id: 27,
        name: "西宁市",
        areas: [
          "城中区",
          "城东区",
          "城西区",
          "城北区",
          "大通回族土族自治县",
          "湟源县",
          "湟中县",
        ],
      },
      // 其他城市...
    ],
  },
  {
    id: 27,
    name: "宁夏回族自治区",
    cities: [
      {
        id: 28,
        name: "银川市",
        areas: ["兴庆区", "西夏区", "金凤区", "永宁县", "贺兰县", "灵武市"],
      },
    ],
  },
  {
    id: 28,
    name: "新疆维吾尔自治区",
    cities: [
      {
        id: 29,
        name: "乌鲁木齐市",
        areas: [
          "天山区",
          "沙依巴克区",
          "新市区",
          "水磨沟区",
          "头屯河区",
          "米东区",
          "乌鲁木齐县",
        ],
      },
      // 其他城市...
    ],
  },
];

module.exports = Citys;
